InformationRegisters/СоответствиеТНВЭДиОКПД2ИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТНВЭДиОКПД2ИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНВЭДПоВидамПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОКПД2ПоВидамПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыКлассификаторовВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКлассификаторовВидовПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТоварныеГруппыГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТоварныеГруппыГИСМТ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТНВЭДПоВидамПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТНВЭДПоВидамПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОКПД2ПоВидамПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОКПД2ПоВидамПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЗагрузкаТНВЭДиОКПД2ИС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПервичнаяНастройкаФормы();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипСпискаЗначенийВидыПродукции(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыПродукцииПоТоварнымГруппам

&НаКлиенте
Процедура ВидыПродукцииПоТоварнымГруппамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипСпискаЗначенийВидыПродукции(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьТабличныйДокумент(Команда)
	
	ЗагрузкаТабличногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	
	Если ВозможноЗаполнениеДанных() Тогда
		ОчиститьСообщения();
		ЗаполнитьДанныеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыПродукцииВДанных(Команда)
	
	ЗаполнениеВидовПродукцииВДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКоды(Команда)
	
	ЗагрузкаКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	СохранениеНастроекВФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ЗагрузкаНастроекИзФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыПродукцииПоТоварнойГруппе(Команда)
	
	ЗаполнениеВидовПродукцииПоТоварнойГруппе();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПервичнаяНастройкаФормы()
	
	Элементы.ПояснениеНастройкиКолонок.Заголовок = НСтр("ru = '0 - колонка не используется'");
	Элементы.ПояснениеНастройки.Заголовок = НСтр(
	"ru = 'Колонка с кодом ТН ВЭД является обязательной. Коды ОКПД2 должны быть разделены символом "","" или "";"". Первая строка с именем колонок может отсутствовать.'");
	
	КолонкаНаименованиеТоварнойГруппы = 1;
	КолонкаКодТоварнойГруппы = 2;
	КолонкаКодТНВЭД = 3;
	КолонкаКодыОКПД2 = 4;
	
	Элементы.ВидыПродукцииПоТоварнымГруппамЗаполнитьВидыПродукцииПоТоварнойГруппе.Видимость = ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипСпискаЗначенийВидыПродукции(Элемент)
	
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ВидыПродукцииИС"));
	Элемент.ТекущиеДанные.ВидыПродукции.ТипЗначения = Новый ОписаниеТипов(Типы);
	
КонецПроцедуры

#Область ЗагрузкаТабличногоДокумента

&НаКлиенте
Процедура ЗагрузкаТабличногоДокумента()
	
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыВыбораФайла.Заголовок          = НСтр("ru = 'Выбор файла с данными'");
	ПараметрыВыбораФайла.Фильтр             = НСтр("ru = 'Книга Excel (*.xls; *.xlsx)|*.xls;*.xlsx'");
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлаНаСервер(
		Новый ОписаниеОповещения("ЗагрузкаТабличногоДокументаЗавершение", ЭтотОбъект),,,,
		ПараметрыВыбораФайла,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТабличногоДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Не Результат.ПомещениеФайлаОтменено Тогда
		ЗагрузкаТабличногоДокументаНаСервере(Результат.Адрес, Результат.СсылкаНаФайл.Расширение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаТабличногоДокументаНаСервере(АдресХранилища, РасширениеФайла)
	
	Путь = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + РасширениеФайла;
	ПолучитьИзВременногоХранилища(АдресХранилища).Записать(Путь);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Прочитать(Путь);
	УдалитьФайлы(Путь);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанных

&НаКлиенте
Функция ВозможноЗаполнениеДанных()
	
	Отказ = Ложь;
	
	Если КолонкаКодТНВЭД = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите колонку с кодом ТН ВЭД'"),,
			"КолонкаКодТНВЭД",,
			Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеСервер()
	
	ТаблицаДанных.Очистить();
	
	ДобавленоТоварныхГрупп = 0;
	
	Для НомерСтроки = 1 по ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Значение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаКодТНВЭД).Текст);
		Если Значение = ""
			Или СтрНайти("0123456789", Лев(Значение, 1)) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Строка = ТаблицаДанных.Добавить();
		Строка.ТНВЭД = Значение;
		
		Если КолонкаКодыОКПД2 > 0 Тогда
			Строка.ОКПД2 =
				СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаКодыОКПД2).Текст);
		КонецЕсли;
		
		НайденнаяСтрока = Неопределено;
		
		Если КолонкаКодТоварнойГруппы > 0 Тогда
			Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(
				СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаКодТоварнойГруппы).Текст));
			Если Значение <> Неопределено Тогда
				Строка.КодТоварнойГруппы = Значение;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("КодТоварнойГруппы", Строка.КодТоварнойГруппы);
			НайденныеСтроки = ВидыПродукцииПоТоварнымГруппам.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
		КонецЕсли;
		
		Если КолонкаНаименованиеТоварнойГруппы > 0 Тогда
			Строка.НаименованиеТоварнойГруппы =
				СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаНаименованиеТоварнойГруппы).Текст);
			Если НайденнаяСтрока = Неопределено Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("НаименованиеТоварнойГруппы", Строка.НаименованиеТоварнойГруппы);
				НайденныеСтроки = ВидыПродукцииПоТоварнымГруппам.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено
			И (ЗначениеЗаполнено(Строка.КодТоварнойГруппы)
				Или ЗначениеЗаполнено(Строка.НаименованиеТоварнойГруппы)) Тогда
			СтрокаТГ = ВидыПродукцииПоТоварнымГруппам.Добавить();
			СтрокаТГ.КодТоварнойГруппы = Строка.КодТоварнойГруппы;
			СтрокаТГ.НаименованиеТоварнойГруппы = Строка.НаименованиеТоварнойГруппы;
			ДобавленоТоварныхГрупп = ДобавленоТоварныхГрупп + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДобавленоТоварныхГрупп > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Добавлено %1 товарных групп - заполните для них соответствие видам продукции'"),
				ДобавленоТоварныхГрупп),,
			"ВидыПродукцииПоТоварнымГруппам");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеВосстановлениеНастроек

&НаКлиенте
Процедура СохранениеНастроекВФайл()
	
	НачатьПолучениеФайлаССервера(
		АдресФайлаНаСервере(),
		ИмяФайлаСохраненияНастроек(),
		Новый ПараметрыДиалогаПолученияФайлов(НСтр("ru = 'Сохранение файла настроек'"), Истина));

КонецПроцедуры

&НаКлиенте
Функция ИмяФайлаСохраненияНастроек()
	
	Возврат НСтр("ru = 'Настройки загрузки ТН ВЭД и ОКПД2.n1c'");
	
КонецФункции

&НаСервере
Функция АдресФайлаНаСервере()
	
	Путь = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ".tmp";
	ЗначениеВФайл(Путь, РеквизитФормыВЗначение("ВидыПродукцииПоТоварнымГруппам"));
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Путь));
	УдалитьФайлы(Путь);
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаНастроекИзФайла()
	
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыВыбораФайла.Заголовок          = НСтр("ru = 'Выбор файла настроек'");
	ПараметрыВыбораФайла.Фильтр             = НСтр("ru = 'Файлы настроек (*.n1c)|*.n1c|Все файлы(*.*)|*.*'");
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлаНаСервер(
		Новый ОписаниеОповещения("ЗагрузкаНастроекИзФайлаЗавершение", ЭтотОбъект),,,,
		ПараметрыВыбораФайла,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНастроекИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Не Результат.ПомещениеФайлаОтменено Тогда
		ЗагрузкаНастроекИзФайлаНаСервере(Результат.Адрес);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаНастроекИзФайлаНаСервере(АдресХранилища)
	
	Путь = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ".tmp";
	ПолучитьИзВременногоХранилища(АдресХранилища).Записать(Путь);
	ДанныеИзФайла = ЗначениеИзФайла(Путь);
	УдалитьФайлы(Путь);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
	ЗначениеВРеквизитФормы(ДанныеИзФайла, "ВидыПродукцииПоТоварнымГруппам");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеВидовПродукцииПоТоварнойГруппе

&НаКлиенте
Процедура ЗаполнениеВидовПродукцииПоТоварнойГруппе()
	
	КодыТоварныхГрупп = Новый Массив;
	СтрокиДляОбработки = Новый Массив;
	
	Для Каждого Строка Из ВидыПродукцииПоТоварнымГруппам Цикл
		Если Строка.ВидыПродукции.Количество() = 0
			И Строка.КодТоварнойГруппы > 0 Тогда
			Если КодыТоварныхГрупп.Найти(Строка.КодТоварнойГруппы) = Неопределено Тогда
				КодыТоварныхГрупп.Добавить(Строка.КодТоварнойГруппы);
			КонецЕсли;
			СтрокиДляОбработки.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если КодыТоварныхГрупп.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТоварныеГруппыПоКоду = ТоварныеГруппыПоКоду(КодыТоварныхГрупп);
	
	МодульИСМП = ОбщегоНазначенияКлиент.ОбщийМодуль("КонструкторИСМПОбщегоНазначенияКлиентСервер");
	
	Для Каждого Строка Из СтрокиДляОбработки Цикл
		ТоварнаяГруппа = ТоварныеГруппыПоКоду[Строка.КодТоварнойГруппы];
		Если ТоварнаяГруппа <> Неопределено Тогда
			ВидыПродукции = МодульИСМП.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
			Строка.ВидыПродукции.ЗагрузитьЗначения(ВидыПродукции);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТоварныеГруппыПоКоду(КодыТоварныхГрупп)
	
	Результат = Новый Соответствие;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаЧисло(12));
	Таблица.Колонки.Добавить("КодДляПоиска", ОбщегоНазначения.ОписаниеТипаЧисло(6));
	
	Для Каждого Код Из КодыТоварныхГрупп Цикл
		Строка = Таблица.Добавить();
		Строка.Код = Код;
		Если Код > 100000 Тогда
			Строка.КодДляПоиска = Код - Окр(Код, -5);
		Иначе
			Строка.КодДляПоиска = Код;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Код,
	|	Таблица.КодДляПоиска
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	Таблица.Код КАК Код,
	|	ТоварныеГруппыГИСМТ.Ссылка КАК ТоварнаяГруппа
	|ИЗ
	|	Таблица КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|	ПО Таблица.КодДляПоиска = ТоварныеГруппыГИСМТ.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Код, Выборка.ТоварнаяГруппа);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеВидовПродукцииВДанных

&НаКлиенте
Процедура ЗаполнениеВидовПродукцииВДанных()
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ВидыПродукцииПоТоварнымГруппам.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Отсутствуют данные для заполнения видов продукции'"),,
			"ВидыПродукцииПоТоварнымГруппам");
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Строка.ВидыПродукции.Очистить();
		СтруктураПоиска.Вставить("КодТоварнойГруппы", Строка.КодТоварнойГруппы);
		НайденныеСтроки = ВидыПродукцииПоТоварнымГруппам.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строка.ВидыПродукции.ЗагрузитьЗначения(НайденныеСтроки[0].ВидыПродукции.ВыгрузитьЗначения());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаКодов

&НаКлиенте
Процедура ЗагрузкаКодов()
	
	ОчиститьСообщения();
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Отсутствуют данные для загрузки'"),,
			"ТаблицаДанных");
		Возврат;
	КонецЕсли;
	
	СтрокиДляЗагрузки = Новый Массив;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(Строка.ТНВЭД)
			И Строка.ВидыПродукции.Количество() > 0 Тогда
			СтрокиДляЗагрузки.Добавить(Строка.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСтрокДляЗагрузки = СтрокиДляЗагрузки.Количество();
	Если КоличествоСтрокДляЗагрузки = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указаны виды продукции для загрузки данных'"),,
			"ТаблицаДанныхВидыПродукции");
		Возврат;
	ИначеЕсли КоличествоСтрокДляЗагрузки <> ТаблицаДанных.Количество() Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"ЗагрузкаКодовВопрос",
				ЭтотОбъект,
				Новый Структура("СтрокиДляЗагрузки", СтрокиДляЗагрузки)),
			СтрШаблон(
				НСтр("ru = 'Доступно для загрузки %1 из %2 (строк). Продолжить?'"),
				КоличествоСтрокДляЗагрузки,
				ТаблицаДанных.Количество()),
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗагрузкаКодовСервер(СтрокиДляЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаКодовВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузкаКодовСервер(ДополнительныеПараметры.СтрокиДляЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаКодовСервер(СтрокиДляЗагрузки)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТНВЭД", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Таблица.Колонки.Добавить("ОКПД2", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Таблица.Колонки.Добавить("ВидПродукции", Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	
	Для Каждого СтрокаДляЗагрузки Из СтрокиДляЗагрузки Цикл
		Строка = ТаблицаДанных.НайтиПоИдентификатору(СтрокаДляЗагрузки);
		ДобавитьДанныеСтрокиВТаблицу(Строка, Таблица);
	КонецЦикла;
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	КоличествоИзменений = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Текст = ТекстЗапросаКодовТНВЭДиОКПД2();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Справочник.ТНВЭДПоВидамПродукцииИС");
	Блокировка.Добавить("Справочник.ОКПД2ПоВидамПродукцииИС");
	Блокировка.Добавить("РегистрСведений.СоответствиеТНВЭДиОКПД2ИС");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВГраница = РезультатЗапроса.ВГраница();
		
		Выборка = РезультатЗапроса[ВГраница - 3].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				ЭлементСправочника = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементСправочника = Справочники.ТНВЭДПоВидамПродукцииИС.СоздатьЭлемент();
			КонецЕсли;
			ЭлементСправочника.КодЧЗ = Выборка.КодЧЗ;
			ЭлементСправочника.ВидПродукции = Выборка.ВидПродукции;
			ЭлементСправочника.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС.Действующий;
			ЭлементСправочника.ДатаИзменения = ТекущаяДата;
			ЭлементСправочника.Записать();
			КоличествоИзменений = КоличествоИзменений + 1;
		КонецЦикла;
		
		Выборка = РезультатЗапроса[ВГраница - 2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				ЭлементСправочника = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				ЭлементСправочника = Справочники.ОКПД2ПоВидамПродукцииИС.СоздатьЭлемент();
			КонецЕсли;
			ЭлементСправочника.КодЧЗ = Выборка.КодЧЗ;
			ЭлементСправочника.ВидПродукции = Выборка.ВидПродукции;
			ЭлементСправочника.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС.Действующий;
			ЭлементСправочника.ДатаИзменения = ТекущаяДата;
			ЭлементСправочника.Записать();
			КоличествоИзменений = КоличествоИзменений + 1;
		КонецЦикла;
		
		Запрос.Текст = ТекстЗапросаСвязейТНВЭДиОКПД2();
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВГраница = РезультатЗапроса.ВГраница();
		
		Выборка = РезультатЗапроса[ВГраница - 2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.СоответствиеТНВЭДиОКПД2ИС.СоздатьМенеджерЗаписи();
			Запись.ТНВЭД   = Выборка.ТНВЭД;
			Запись.ОКПД2   = Выборка.ОКПД2;
			Запись.Изменен = Истина;
			Запись.Записать();
			КоличествоИзменений = КоличествоИзменений + 1;
		КонецЦикла;
		
		Выборка = РезультатЗапроса[ВГраница - 1].Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.СоответствиеТНВЭДиОКПД2ИС.СоздатьМенеджерЗаписи();
			Запись.ТНВЭД   = Выборка.ТНВЭД;
			Запись.ОКПД2   = Выборка.ОКПД2;
			Запись.Изменен = Истина;
			Запись.ПометкаУдаления = Истина;
			Запись.Удалить();
			КоличествоИзменений = КоличествоИзменений + 1;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если КоличествоИзменений = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Обработка загрузки кодов завершена. Данных для загрузки / изменения не обнаружено.'")
	Иначе
		ТекстСообщения = НСтр("ru = 'Коды успешно загружены.'")
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеСтрокиВТаблицу(Строка, Таблица)
	
	Если Строка = Неопределено
		Или Не ЗначениеЗаполнено(Строка.ТНВЭД)
		Или Строка.ВидыПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Разделители = Новый Массив;
	Разделители.Добавить(",");
	Разделители.Добавить(";");
	
	КодыОКПД2 = Новый Массив;
	Если СтрДлина(Строка.ОКПД2) >= 12 Тогда
		ТекущийРазделитель = ",";
		Для Каждого Разделитель Из Разделители Цикл
			Если СтрНайти(Строка.ОКПД2, Разделитель) > 0 Тогда
				ТекущийРазделитель = Разделитель;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Массив = СтрРазделить(Строка.ОКПД2, ТекущийРазделитель);
		Для Каждого Код Из Массив Цикл
			Код = СокрЛП(Код);
			Если СтрДлина(Код) = 12
				И КодыОКПД2.Найти(Код) = Неопределено Тогда
				КодыОКПД2.Добавить(Код);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если КодыОКПД2.Количество() = 0 Тогда
		КодыОКПД2.Добавить("");
	КонецЕсли;
	
	ВидыПродукции = Новый Массив;
	Для Каждого ЭлементСписка Из Строка.ВидыПродукции Цикл
		Если ЗначениеЗаполнено(ЭлементСписка.Значение)
			И ВидыПродукции.Найти(ЭлементСписка.Значение) = Неопределено Тогда
			ВидыПродукции.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ВидыПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		Для Каждого ОКПД2 Из КодыОКПД2 Цикл
			СтрокаТаблицы = Таблица.Добавить();
			СтрокаТаблицы.ТНВЭД = Строка.ТНВЭД;
			СтрокаТаблицы.ВидПродукции = ВидПродукции;
			СтрокаТаблицы.ОКПД2 = ОКПД2;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаКодовТНВЭДиОКПД2()
	
	Возврат
	"ВЫБРАТЬ
	|	Таблица.ТНВЭД,
	|	Таблица.ОКПД2,
	|	Таблица.ВидПродукции
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.ТНВЭД,
	|	Таблица.ВидПродукции
	|ПОМЕСТИТЬ ТаблицаТНВЭД
	|ИЗ
	|	Таблица КАК Таблица
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.ОКПД2,
	|	Таблица.ВидПродукции
	|ПОМЕСТИТЬ ТаблицаОКПД2
	|ИЗ
	|	Таблица КАК Таблица
	|ГДЕ
	|	Таблица.ОКПД2 <> """"
	|;
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК КодЧЗ,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	ТаблицаТНВЭД КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО Таблица.ТНВЭД = ТаблицаСправочника.Код
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|		И ТаблицаСправочника.Код <> ТаблицаСправочника.КодЧЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК КодЧЗ,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	NULL КАК Ссылка
	|ИЗ
	|	ТаблицаТНВЭД КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО (Таблица.ТНВЭД = ТаблицаСправочника.Код
	|			ИЛИ Таблица.ТНВЭД = ТаблицаСправочника.КодЧЗ)
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|ГДЕ
	|	ТаблицаСправочника.Ссылка ЕСТЬ NULL
	|;
	|ВЫБРАТЬ
	|	Таблица.ОКПД2 КАК КодЧЗ,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	ТаблицаОКПД2 КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО Таблица.ОКПД2 = ТаблицаСправочника.Код
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|		И ТаблицаСправочника.Код <> ТаблицаСправочника.КодЧЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.ОКПД2 КАК КодЧЗ,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	NULL КАК Ссылка
	|ИЗ
	|	ТаблицаОКПД2 КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО (Таблица.ОКПД2 = ТаблицаСправочника.Код
	|			ИЛИ Таблица.ОКПД2 = ТаблицаСправочника.КодЧЗ)
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|ГДЕ
	|	ТаблицаСправочника.Ссылка ЕСТЬ NULL
	|;
	|УНИЧТОЖИТЬ ТаблицаТНВЭД
	|;
	|УНИЧТОЖИТЬ ТаблицаОКПД2";
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаСвязейТНВЭДиОКПД2()
	
	Возврат
	"ВЫБРАТЬ
	|	СправочникТНВЭД.Ссылка КАК ТНВЭД,
	|	СправочникОКПД2.Ссылка КАК ОКПД2
	|ИЗ
	|	Таблица КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК СправочникТНВЭД
	|	ПО Таблица.ТНВЭД = СправочникТНВЭД.КодЧЗ
	|		И Таблица.ВидПродукции = СправочникТНВЭД.ВидПродукции
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК СправочникОКПД2
	|	ПО Таблица.ОКПД2 = СправочникОКПД2.КодЧЗ
	|		И Таблица.ВидПродукции = СправочникОКПД2.ВидПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК ТаблицаРегистра
	|	ПО СправочникТНВЭД.Ссылка = ТаблицаРегистра.ТНВЭД
	|		И СправочникОКПД2.Ссылка = ТаблицаРегистра.ОКПД2
	|ГДЕ
	|	ТаблицаРегистра.ТНВЭД ЕСТЬ NULL
	|;
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ТНВЭД КАК ТНВЭД,
	|	ТаблицаРегистра.ОКПД2 КАК ОКПД2
	|ИЗ
	|	РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ТНВЭД.ВидПродукции <> ТаблицаРегистра.ОКПД2.ВидПродукции
	|;
	|УНИЧТОЖИТЬ Таблица";
	
КонецФункции

#КонецОбласти

#КонецОбласти
